# 将选择三种天赋的文案存储在变量talent_choice中
talent_choice = ["现有以下三种天赋可供选择：",
                 "1.中产离异家庭，乐观，网络狂魔",
                 "2.中法混血，超凡美貌，家道中落",
                 "3.早产儿，天资聪慧，生于乡村", ]
# 将选择3种天赋所触发的剧情分别存储在变量talent_answer1,talent_answer2,talent_answer3中
talent_answer1 = ["4岁上幼儿园", "5岁在班上炫耀新玩具，被老师没收了", "7岁老师在班上进行了IQ测试，你IQ平平", "10岁努力学习的一年，感受到进步", "11岁开始追星", "12岁考上普通中学",
                  "13岁为爱豆刷数据花光压岁钱", "15岁爱豆吸毒入狱，全网封禁", "16岁考上普通高中", "17岁沉迷二次元，天天追新番", "18岁，考上普通师范学校",
                  "19岁，加入了动漫社，凭借阅番无数的经验成为社长", "20岁凭本事长胖10斤", "21岁网恋"]
talent_answer2 = ["3岁回到上海", "5岁被星探挖掘，成为广告模特", "6岁父亲欠下巨额债务并消失", "7岁一边上学一边还债", "9岁母亲运营自媒体账号，成为百万粉丝大V", "10岁你被同班同学霸凌",
                  "12岁抑郁没考上中学", "13岁在家修养一年，爱上画画", "15岁一边学画画一边做模特", "16岁回到学校，再次成为话题人物", "17岁终于还清父亲欠下的债务", "18岁搬家到成都",
                  "19岁以艺术生的方式考入大学", "20岁和当红流量明星一起拍广告"]
talent_answer3 = ["刚出生父母双亡", "3岁吃不起拉面，被预言是天选之子", "5岁认识了第一个朋友，结果朋友挂了", "7岁上忍者小学成绩吊尾", "9岁学会搓丸子", "12岁和最好的朋友撕逼",
                  "16岁达到人生巅峰扬名海内外", "19岁剪了寸头结婚了"]

# 将选择“逐梦天涯”的剧情分别存储在变量choice1_talent1，choice1_talent2，choice1_talent3中
choice1_talent1 = ["22岁和男友分手后，决心搞钱", "23岁你成为某二次元论坛的版主，并开了网店卖手办", "24岁我国人均GDP超越美国", "25岁网店年营业额破百万", "26岁买了房",
                   "30岁环游世界20个国家", "32岁领养了一个女孩", "35岁2个闺蜜离婚", "40岁和2个闺蜜在乡下建了别墅", "45岁退休，开始瑜伽和长跑", "50岁有健美杂志找你做模特",
                   "52岁，世界上首个没有婚姻的国家出现了", "60岁得癌症", "61岁在睡梦中平静离世"]
choice1_talent2 = ["21岁和顶流拍广告成为话题女星", "23岁放弃学业参加选秀", "25岁出演偶像剧女主，但剧情拉垮被网友嘲讽", "26岁和男明星隐婚生子", "27岁离婚成为单亲妈妈",
                   "28岁，回法国学设计", "32岁开设亲子服装网店", "35岁在8个城市开了超过30家店铺", "38岁财务自由", "40岁儿子在学校遭遇校园霸凌", "42岁成立基金会，帮扶被霸凌的儿童",
                   "44岁投资并参演校园霸凌题材的电影", "45岁遭遇疫情，关闭20家实体店铺", "50岁资产缩水但没有减少公益投入", "60岁儿子出柜，你表示支持", "70岁在海边别墅平静离开"]
choice1_talent3 = ["30岁就有了两个娃", "32岁当上村长", "35岁因为大儿子惹事招来仇家被打死，卒"]

# 将选择“找份安稳工作”的剧情分别存储在变量choice2_talent1，choice2_talent2，choice2_talent3中
choice2_talent1 = ["22岁和网恋对象奔现", "23岁被家长催考公务员", "25岁考上地方财政局，成为父亲酒局上最大的谈资", "26岁怀孕并结婚", "28岁生二胎", "30岁国家开放三胎", "但你坚决不生",
                   "老公话不多但顾家", "35岁买了第二套房", "40岁老公冲动创业亏了一套", "45岁每天下班鸡娃", "女儿学霸儿子学渣", "60岁退休給儿子带娃", "65岁給女儿带娃",
                   "70岁国家补贴3胎家庭每月2万", "75岁癌症已被攻克", "80岁老伴离世", "你吃斋念佛活到99"]
choice2_talent2 = ["21岁放弃演艺圈生活，安心读书", "22岁进入传媒公司打工", "25岁连升2级成为部门主管", "27岁你养了1只猫咪", "29岁你养了8只猫咪", "32岁传媒公司不景气被裁员",
                   "33岁找到新工作", "35岁出国读研", "40岁定居海外", "航天技术取得巨大突破", "45岁你前往火星旅行，出现意外，卒"]
choice2_talent3 = ["30岁就有了两个娃", "32岁当上村长", "35岁因为大儿子惹事招来仇家被打死，卒"]

# 游戏开篇设置

# 游戏开篇显示游戏标题
print("*" * 23 + "人生重开模拟器" + "*" * 23)
# 使用input()函数等待玩家输入名字，并将输入的名字赋值給变量name
name = input("在输入框中给自己取一个名字吧：")
# 使用print()函数格式化输出f"好的，谢谢你{name}"
print(f"好的，谢谢你{name}")

# 第一个剧情点；天赋选择

# TODO 导入time模块

import time

# for循环依次输出变量talent_choice中存储的内容
for i in talent_choice:
    # 每次输出前，停顿1秒
    time.sleep(2)
    # 输出元素
    print(i)
# 使用input()函数等待玩家输入选择的天赋，使用int()函数转化为整型，并赋值给变量talent
talent = int(input("请选择一种天赋："))


# TODO 定义get_list函数，参数为list，s作用是依次获取列表list中的元素并输出，每次输出前停顿s秒
def get_list(list, s):
    # 函数主体部分：依次从列表中提取元素
    for i in list:
        # TODO 每次输出前，停顿s秒
        time.sleep(s)
        # 输出元素
        print(i)


# 使用if elif else条件判断，判断选择的天赋并输出相应的剧请
if talent == 1:
    # TODO 调用get_list函数，设置参数为天赋1对应的剧情talent_answer1，停顿秒数为1秒
    get_list(talent_answer1, 1)
elif talent == 2:
    get_list(talent_answer2, 1)
else:
    get_list(talent_answer3, 1)

# 第二个剧情点：成年后的选择


# 使用input()函数接收选择，并将选择的内容存储到变量choice中，并使用int()函数将输入的内容转化为整型
choice = int(input("成年后你面临两种选择：1.逐梦天涯  2.找一份安稳的工作，你的选择是："))

# 使用if elif else条件判断，判断玩家选择逐梦天涯时（choice == 1）输出对应玩家天赋的剧情
if choice == 1:
    # 输出"你选择了逐梦天涯"
    print("你选择了逐梦天涯。")
    # 判断当天赋选择为1时
    if talent == 1:
        # 调用get_list函数依次输出choice1_talent1中的剧情
        get_list(choice1_talent1, 1)
    # 判断当天赋选择为2时
    elif talent == 2:
        # 调用get_list函数依次输出choice1_talent2中的剧情
        get_list(choice1_talent2, 1)
    # 判断当选择情况为其他时
    else:
        # 调用get_list函数依次输出choice1_talent3中的剧情
        get_list(choice1_talent3, 1)
# 使用条件判断，判断玩家选择安稳工作时（choice == 2）输出对应天赋的剧情

elif choice == 2:
    # 输出"你选择了找一份安稳工作。"
    print("你选择了找一份安稳工作。")
    # 判断当天赋选择为1时
    if talent == 1:
        # 调用get_list函数依次输出choice2_talent1中的剧情
        get_list(choice2_talent1, 1)
    # 判断当天赋选择为2时
    elif talent == 2:
        # 调用get_list函数依次输出choice2_talent2中的剧情
        get_list(choice2_talent2, 1)
    # 判断当选择情况为其他时
    else:
        # 调用get_list函数依次输出choice2_talent3中的剧情
        get_list(choice2_talent3, 1)
